Core/src/DataProcessors/ЗагрузкаКурсовВалютГрузия/ЗагрузкаКурсовВалютГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалютГрузия</name>
</mdclass:DataProcessor>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/DataProcessors/ЗагрузкаКурсовВалютГрузия/ObjectModule.bsl
// Реализация стандартного интерфейса для подключаемых обработок и отчетов

// Инициализация при загрузке в ИБ
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Загрузка курсов валют 8.2.* (Грузия)");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "1.0.6");
	РегистрационныеДанные.Вставить("ВерсияБСП", "1.2.1.4");
	//ДополнительнаяОбработка
	//ДополнительныйОтчет
	//ЗаполнениеОбъекта
	//Отчет
	//ПечатанаяФорма
	//СозданиеСвязанныхОбъектов
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	
	РегистрационныеДанные.Вставить("Информация", "Загрузка курсов валют 8.2.* (Грузия) LLC Optimus ©");
	
	///////////// команды /////////////////////////
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "1";
	строкаКоманды.Представление = "Загрузка курсов валют (ОткрытиеФормы)";
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ОткрытиеФормы";
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "2";
	строкаКоманды.Представление = "Загрузка курсов валют (загрузка на сервере)";
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ВызовСерверногоМетода";

	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
		
	Возврат РегистрационныеДанные;
КонецФункции

// Обработка команд экспортированных обработкой
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	// Реализация логики команды
	Если ИдентификаторКоманды = "2" Тогда
		ЗагрузитьКурсыВалют();
	КонецЕсли;
КонецПроцедуры

// Серверные методы для загрузки курсов

//Загрузка данных о курсах с сайта
Функция ЗагрузитьКурсыВалют(ПутьКRSS = "http://www.nbg.gov.ge/rss.php", РежимВыводаСообщений = Ложь) Экспорт 
	
	//Паганини_
	Р_Д_Ч = Сред(Строка(1/2), 2, 1);
	//_Паганини
	ДатаИзДанных = Неопределено;
	ТекущаяДата = ТекущаяДата();
	XML_Документ = Новый ЧтениеXML();
	XML_Документ.ОткрытьФайл(ПутьКRSS);
	Пока XML_Документ.Прочитать() Цикл
		Если XML_Документ.Имя = "item" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Пока XML_Документ.Прочитать() Цикл
				Если XML_Документ.Имя = "title" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					XML_Документ.Прочитать(); // Проситаем содержимое
					ДатаИзДанных = Дата(СтрЗаменить(Прав(XML_Документ.Значение, 10), "-", "")); // с правой стороны 10 символов это дата 
				ИначеЕсли XML_Документ.Имя = "link" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					XML_Документ.Прочитать(); // Прочитаем содержимое 
				ИначеЕсли XML_Документ.Имя = "description" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					XML_Документ.Прочитать(); // Прочитаем содержимое
					// Добавим запись в журнал регистрации
					ЗаписьЖурналаРегистрации("Optimus.ЗагрузкаКурсов"
											, УровеньЖурналаРегистрации.Информация, , ,"Данные с сайта " + ПутьКRSS + " полученны успешно.");
					
					ТекстКурсов = XML_Документ.Значение;
					Пока Найти(ТекстКурсов, "<tr>") > 0 Цикл // Пройдёмся по строкам полученной таблицы
						
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<tr>") + 4);
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<td>") + 4);
						
						КодВалюты = Лев(ТекстКурсов, 3);
						
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<td>") + 4);
						КратностьВалюты = Число(Лев(ТекстКурсов, Найти(ТекстКурсов," ") - 1));
						
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<td>") + 4);
						//Паганини_
					    ТекстКурсов = СтрЗаменить(ТекстКурсов, ".", Р_Д_Ч);
						//_Паганини
						КурсВалюты = Число(Лев(ТекстКурсов, 6));
						
						// Вызовим обновление / создание курса для валюты на сервере
						Результат = ДобавитьКурсДляВалюты(ТекущаяДата, КодВалюты, КурсВалюты, КратностьВалюты);						
					КонецЦикла;
					Прервать; // Прекращаем работу так как курсы уже загрузили, а дальще если что-то есть нас не интересует
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; // XML_Документ.Имя = "item" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента
	КонецЦикла;
Возврат ДатаИзДанных; 
КонецФункции

// Запись курса на конкретную дату если валюта в ИБ присутствует
Функция ДобавитьКурсДляВалюты(ДатаКурса, СимвольныйКодВалюта, КурсВалюты, КратностьВалюты) Экспорт 

	ВыбраннаяВалюта = Справочники.Валюты.НайтиПоНаименованию(СимвольныйКодВалюта, Истина);
	// Если валюты с таким символьным кодом нет то делать ничего и не надо
	Если ВыбраннаяВалюта = Неопределено Или ВыбраннаяВалюта.Пустая() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	Курс = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	Курс.Период = ДатаКурса;
	Курс.Валюта = ВыбраннаяВалюта;
	Курс.Курс = КурсВалюты;
	Курс.Кратность = КратностьВалюты;
	Курс.Записать();
Возврат Истина;	
КонецФункции
